{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Week 5: Graph Data Modelling (Neo4j)\n",
    "### Student ID: B96323\n",
    "### Subtasks Done: [1]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Task 1: Convert a RDB to a Graph DB\n",
    "In this task, you are going to:\n",
    "- Watch a Video explaining the advtanges of Graph Databases over RDBMS\n",
    "- Remodel a toy RDB into a Graph DB.\n",
    "- Create the a graph of the toy database using Cyper Language"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Watch the following video and mention some of the advantages of using Graph Databases over RDBMS\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"560\"\n",
       "            height=\"315\"\n",
       "            src=\"https://www.youtube.com/embed/NO3C-CWykkY\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x10b77f1d0>"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from IPython.display import IFrame\n",
    "IFrame('https://www.youtube.com/embed/NO3C-CWykkY', width=560, height=315)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<font color = \"Red\"><b>Advantages of Using Neo4J over RDBMS:</b></font>\n",
    "<br>1. Performance - stay constant even as your data grows year over year\n",
    "<br>2. Flexibility - the structure and schema of a graph model flexes as applications and industries change\n",
    "<br>3. Agility - graph databases aligns perfectly with today's agile, test-driven development practices\n",
    "\n",
    "[Reference](https://neo4j.com/why-graph-databases/)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Given the following toy relational database, Convert this toy database into a Graph database using any drawing software. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"RDBSchema.png\" alt=\"3\" border=\"0\">"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "#### YOUR IMAGE of The Property Graph Schema HERE (use whatever drawing tool)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<img src=\"graph_neo4j.png\"/>"
      ],
      "text/plain": [
       "<IPython.core.display.Image object>"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from IPython.display import Image\n",
    "Image(url= \"graph_neo4j.png\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Use Cypher Query Language to create the above Graph toy database, you have just drawed"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### py2neo\n",
    "\n",
    "py2neo is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install py2neo with pip install py2neo.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### Connect\n",
    "\n",
    "Connect to Neo4j with the Graph class.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "# !pip install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "try:\n",
    "    graph = Graph(auth=(\"neo4j\", \"12345\"))\n",
    "except:\n",
    "    print(\"Error Connection to Neo4j DB!!\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### clear every thing in the graph DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### Nodes\n",
    "\n",
    "Create nodes with the Node class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "# \n",
    "#Person_Nodes\n",
    "charlSheen = Node(\"Person\", id=1, name=\"Charlie Sheen\")\n",
    "MichDouglas = Node(\"Person\", id=2, name=\"Micheal Douglas\")\n",
    "martSheen = Node(\"Person\", id=3, name=\"Martin Sheen\")\n",
    "morgan = Node(\"Person\", id=4, name=\"Morgan Freeman\")\n",
    "\n",
    "#Movie_Nodes\n",
    "\n",
    "wallst = Node(\"Movie\", id=1, title=\"Wall Street\", year=1987)\n",
    "americanPres = Node(\"Movie\",id=2, title=\"The American President\", year=1995)\n",
    "shawshank = Node(\"Movie\",id=3, title=\"The Shawshank Redemption\", year=1994)\n",
    "\n",
    "#Country_Nodes\n",
    "usa = Node(\"Country\", name=\"USA\")\n",
    "\n",
    "\n",
    "graph.create(charlSheen | MichDouglas | martSheen | morgan | wallst | americanPres | shawshank | usa)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Check created nodes in the graph using Cypher query (Find all nodes in your DB)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=1, title='Wall Street', year=1987)\n",
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Country', name='USA')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\" MATCH (n) RETURN n; \"\"\"\n",
    "allNodes = graph.run(query)\n",
    "for node in allNodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "### Relationships\n",
    "\n",
    "Create relationships between nodes with the Relationship class.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "#MADE_IN RelationShips\n",
    "graph.create(Relationship(wallst, \"MADE_IN\", usa))\n",
    "graph.create(Relationship(americanPres, \"MADE_IN\", usa))\n",
    "graph.create(Relationship(shawshank, \"MADE_IN\", usa))\n",
    "\n",
    "#PLAYED Relationships\n",
    "graph.create(Relationship(charlSheen, \"PLAYED\", wallst, role=[\"Bud Fox\"]))\n",
    "graph.create(Relationship(martSheen, \"PLAYED\", wallst, role=[\"Carl Fox\"]))\n",
    "graph.create(Relationship(MichDouglas, \"PLAYED\", wallst, role=[\"Gordon Gekko\"]))\n",
    "\n",
    "graph.create(Relationship(martSheen, \"PLAYED\", americanPres, role=[\"A.J. MacInerney\"]))\n",
    "graph.create(Relationship(MichDouglas, \"PLAYED\", americanPres, role=[\"President Andrew Shepherd\"]))\n",
    "\n",
    "graph.create(Relationship(morgan, \"PLAYED\", shawshank, role=[\"Ellis Boyd 'Red' Redding\"]))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Extend you \"Movies\" Knowledge Graph (The power of Graph DBs!!)\n",
    "\n",
    "Imagine now that we are going to extend our graph DB with new movies, actors, even with new directors.\n",
    "\n",
    "- We add <b>\"The matrix\"</b> movie which was released in <b>(1999)</b>, and has a new property \"Tagline\" <b>(\"Welcome to the Real World\")</b>.\n",
    "- We also add 4 new actors (Person):\n",
    "    - \"Keanu Reeves\" who was born in (1964). Note \"born\" property is also new.\n",
    "    - \"Carrie-Anne Moss\" who was born in (1967).\n",
    "    - \"Laurence Fishburne\" who was born in (1960).\n",
    "    - \"Hugo Weaving\" who was born in (1960).\n",
    "- Moreover, we add 3 directors (Person) :\n",
    "    - 'Lilly Wachowski', born in (1967)\n",
    "    - 'Lana Wachowski', born in(1965)\n",
    "    - 'Joel Silver', born in (1952)\n",
    "- For these directors specify one more Label (\"Director\").\n",
    "- We Create a new <b>RelationType \"DIRECTED\" </b> that goes from the later 3 director nodes to \"the Matrix\" movie node."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the \"The Matrix\" new movie node into your DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "# ! pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "# %load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "# %%cypher  https://localhost:7687/neo4j\n",
    "# # MATCH (n:Person) RETURN n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=1, title='Wall Street', year=1987)\n",
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\" MATCH (n:Movie) RETURN n; \"\"\"\n",
    "allNodes = graph.run(query)\n",
    "for node in allNodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [],
   "source": [
    "creMoviequery =\"\"\" CREATE (thematrix:Movie{id:4, title:\"The Matrix\", year:1999, tagline:\"Welcome to the Real World\"}) \"\"\"\n",
    "data = graph.run(creMoviequery)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the Actors nodes into your DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\" MATCH (n:Person) RETURN n; \"\"\"\n",
    "allNodes = graph.run(query)\n",
    "for node in allNodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "creActorsquery = \"\"\"\n",
    "CREATE (Keanu:Person{id:5, name:\"Keanu Reeves\", born:1964}),\n",
    "(CaMoss:Person{id:6, name:\"Carrie-Anne Moss\", born:1967}),\n",
    "(LauFish:Person{id:7, name:\"Laurence Fishburne\", born:1960}),\n",
    "(HuWeaving:Person{id:8, name:\"Hugo Weaving\", born:1960})\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "data = graph.run(creActorsquery)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the Director nodes into your DB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [],
   "source": [
    "creDirectorsquery =\"\"\"\n",
    "CREATE (LiWa:Person{id:5, name:\"Lilly Wachowski\", born:1967, role:\"Director\"}),\n",
    "(LaWa:Person{id:6, name:\"Lana Wachowski\", born:1965, role:\"Director\"}),\n",
    "(JoelSilver:Person{id:7, name:\"Joel Silver\", born:1952, role:\"Director\"})\n",
    "\"\"\"\n",
    "data = graph.run(creDirectorsquery)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\n",
      "Node('Person', born=1967, id=5, name='Lilly Wachowski', role='Director')\n",
      "Node('Person', born=1965, id=6, name='Lana Wachowski', role='Director')\n",
      "Node('Person', born=1952, id=7, name='Joel Silver', role='Director')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\" MATCH (n:Person) RETURN n; \"\"\"\n",
    "allNodes = graph.run(query)\n",
    "for node in allNodes:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Create/Insert the required relationships into your DB\n",
    "- (actor) -- :PLAYED(role(s)) --> (The Matrix Movie)\n",
    "- (director)-- :DIRECTED--> (The Matrix Movie)    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Keanu Reeves'\tPLAYED(Node('Person', born=1964, id=5, name='Keanu Reeves'), Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999), role=['Neo'])\t'The Matrix' \n",
      "\n",
      "'Carrie-Anne Moss'\tPLAYED(Node('Person', born=1967, id=6, name='Carrie-Anne Moss'), Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999), role=['Trinity'])\t'The Matrix' \n",
      "\n",
      "'Laurence Fishburne'\tPLAYED(Node('Person', born=1960, id=7, name='Laurence Fishburne'), Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999), role=['Morpheus'])\t'The Matrix' \n",
      "\n",
      "'Hugo Weaving'\tPLAYED(Node('Person', born=1960, id=8, name='Hugo Weaving'), Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999), role=['Agent Smith'])\t'The Matrix' \n",
      "\n"
     ]
    }
   ],
   "source": [
    "creRELSquery =\"\"\" \n",
    "MATCH (actor:Person),(movie:Movie)\n",
    "WHERE actor.name = 'Keanu Reeves' AND movie.title = 'The Matrix'\n",
    "CREATE (actor)-[r:PLAYED{role:['Neo']}]->(movie)\n",
    "\n",
    "RETURN actor.name, r, movie.title\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(creRELSquery)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")\n",
    "    \n",
    "creRELSquery =\"\"\" \n",
    "MATCH (actor:Person),(movie:Movie)\n",
    "WHERE actor.name = 'Carrie-Anne Moss' AND movie.title = 'The Matrix'\n",
    "CREATE (actor)-[r:PLAYED{role:['Trinity']}]->(movie)\n",
    "\n",
    "RETURN actor.name, r, movie.title\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(creRELSquery)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")\n",
    "\n",
    "creRELSquery =\"\"\" \n",
    "MATCH (actor:Person),(movie:Movie)\n",
    "WHERE actor.name = 'Laurence Fishburne' AND movie.title = 'The Matrix'\n",
    "CREATE (actor)-[r:PLAYED{role:['Morpheus']}]->(movie)\n",
    "\n",
    "RETURN actor.name, r, movie.title\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(creRELSquery)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")\n",
    "    \n",
    "creRELSquery =\"\"\"\n",
    "MATCH (actor:Person),(movie:Movie)\n",
    "WHERE actor.name = 'Hugo Weaving' AND movie.title = 'The Matrix'\n",
    "CREATE (actor)-[r:PLAYED{role:['Agent Smith']}]->(movie)\n",
    "\n",
    "RETURN actor.name, r, movie.title\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(creRELSquery)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Lilly Wachowski'\tDIRECTED(Node('Person', born=1967, id=5, name='Lilly Wachowski', role='Director'), Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999))\t'The Matrix' \n",
      "\n",
      "'Lana Wachowski'\tDIRECTED(Node('Person', born=1965, id=6, name='Lana Wachowski', role='Director'), Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999))\t'The Matrix' \n",
      "\n"
     ]
    }
   ],
   "source": [
    "creRELSquery =\"\"\" \n",
    "MATCH (director:Person),(movie:Movie)\n",
    "WHERE director.name = 'Lilly Wachowski' AND movie.title = 'The Matrix'\n",
    "CREATE (director)-[r:DIRECTED]->(movie)\n",
    "\n",
    "RETURN director.name, r, movie.title\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(creRELSquery)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")\n",
    "    \n",
    "creRELSquery =\"\"\" \n",
    "MATCH (director:Person),(movie:Movie)\n",
    "WHERE director.name = 'Lana Wachowski' AND movie.title = 'The Matrix'\n",
    "CREATE (director)-[r:DIRECTED]->(movie)\n",
    "\n",
    "RETURN director.name, r, movie.title\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(creRELSquery)\n",
    "for d in data:\n",
    "    print(d, \"\\n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Another way, we can run this in the neo4j Web-browser as a full Cypher query!\n",
    "- Please Don't run this if you already created all the graph nodes and relationships.\n",
    "\n",
    "```\n",
    "MERGE (TheMatrix:Movie {id:4, title:'The Matrix', year:1999, tagline:'Welcome to the Real World'})\n",
    "\n",
    "MERGE (Keanu:Person {id:5, name:'Keanu Reeves', born:1964})\n",
    "MERGE (Carrie:Person {id:6, name:'Carrie-Anne Moss', born:1967})\n",
    "MERGE (Laurence:Person {id:7,name:'Laurence Fishburne', born:1961})\n",
    "MERGE (Hugo:Person {id:8,name:'Hugo Weaving', born:1960})\n",
    "\n",
    "MERGE (LillyW:Person:Director {id:9,name:'Lilly Wachowski', born:1967})\n",
    "MERGE (LanaW:Person:Director {id:10,name:'Lana Wachowski', born:1965})\n",
    "\n",
    "\n",
    "MERGE (Keanu)-[:PLAYED {role:['Neo']}]->(TheMatrix)\n",
    "MERGE (Carrie)-[:PLAYED {role:['Trinity']}]->(TheMatrix)\n",
    "MERGE (Laurence)-[:PLAYED {role:['Morpheus']}]->(TheMatrix)\n",
    "MERGE (Hugo)-[:PLAYED {role:['Agent Smith']}]->(TheMatrix)\n",
    "\n",
    "MERGE (LillyW)-[:DIRECTED]->(TheMatrix)\n",
    "MERGE (LanaW)-[:DIRECTED]->(TheMatrix)\n",
    "\n",
    "```\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### After Running Such new Insertions to The Graph it will look like That"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center> <img src=\"moviesGraph.JPG\" alt=\"3\" border=\"0\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get all the Person Nodes in the GDB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\n",
      "Node('Person', born=1967, id=5, name='Lilly Wachowski', role='Director')\n",
      "Node('Person', born=1965, id=6, name='Lana Wachowski', role='Director')\n",
      "Node('Person', born=1952, id=7, name='Joel Silver', role='Director')\n",
      "Node('Person')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Person)\n",
    "RETURN n\n",
    "\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get All Movies from the Previous Graph, sorted from recent to old"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999)\n",
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Movie', id=1, title='Wall Street', year=1987)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "RETURN n\n",
    "ORDER BY n.year DESC\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get All Movies released in the <b>90s</b> (after year (1990) and before 2000) ordered from old to recent."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Movie', id=3, title='The Shawshank Redemption', year=1994)\n",
      "Node('Movie', id=2, title='The American President', year=1995)\n",
      "Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=1999)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "WHERE n.year > 1990 AND n.year < 2000\n",
    "RETURN n\n",
    "ORDER BY n.year\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get Movies and Actors from the Previous Graph "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Micheal Douglas'\t'The American President'\n",
      "'Martin Sheen'\t'The American President'\n",
      "'Micheal Douglas'\t'Wall Street'\n",
      "'Martin Sheen'\t'Wall Street'\n",
      "'Charlie Sheen'\t'Wall Street'\n",
      "'Morgan Freeman'\t'The Shawshank Redemption'\n",
      "'Hugo Weaving'\t'The Matrix'\n",
      "'Laurence Fishburne'\t'The Matrix'\n",
      "'Carrie-Anne Moss'\t'The Matrix'\n",
      "'Keanu Reeves'\t'The Matrix'\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person) -[:PLAYED]->(m:Movie)\n",
    "RETURN DISTINCT p.name, m.title\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get count of \"Movies\" in your graphDB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Count=  4\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "RETURN COUNT(*)\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(\"Count= \",d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### In this graph, for every \"Actor\" get the number of movies he played "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Micheal Douglas'\t2\n",
      "'Martin Sheen'\t2\n",
      "'Charlie Sheen'\t1\n",
      "'Morgan Freeman'\t1\n",
      "'Hugo Weaving'\t1\n",
      "'Laurence Fishburne'\t1\n",
      "'Carrie-Anne Moss'\t1\n",
      "'Keanu Reeves'\t6\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person) -[:PLAYED]->(m:Movie)\n",
    "RETURN DISTINCT p.name, COUNT(*)\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTES**: I accidentally made mistake with `Keanu Reeves` actor relationship, I ran it until 6 times, that made him to have six number of movies"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### In this graph, List the movies that every Actor Played\n",
    "<b>Hint:</b> use the aggregation function \"COLLECT\" to group movies as a list."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "'Micheal Douglas'\t['The American President', 'Wall Street']\n",
      "'Martin Sheen'\t['The American President', 'Wall Street']\n",
      "'Charlie Sheen'\t['Wall Street']\n",
      "'Morgan Freeman'\t['The Shawshank Redemption']\n",
      "'Hugo Weaving'\t['The Matrix']\n",
      "'Laurence Fishburne'\t['The Matrix']\n",
      "'Carrie-Anne Moss'\t['The Matrix']\n",
      "'Keanu Reeves'\t['The Matrix', 'The Matrix', 'The Matrix', 'The Matrix', 'The Matrix', 'The Matrix']\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (m:Movie)<-[:PLAYED]-(a:Person)\n",
    "RETURN a.name, collect(m.title) AS movie\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**NOTES**: I accidentally made mistake with `Keanu Reeves` actor relationship, I ran it until 6 times, that made him to have six number of movies"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "####  Get List of Directors From the graph "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Directors: \n",
      "Node('Person', born=1967, id=5, name='Lilly Wachowski', role='Director')\n",
      "Node('Person', born=1965, id=6, name='Lana Wachowski', role='Director')\n",
      "Node('Person', born=1952, id=7, name='Joel Silver', role='Director')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)\n",
    "WHERE p.role = \"Director\"\n",
    "RETURN p\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "print(\"Directors: \")\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Update the release year of \"The Matrix\" movie to be 2005, and show that movie before and after this update"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Matrix before updte: \n",
      "'The Matrix'\t1999 \n",
      "\n",
      "The matrix Updated: \n",
      "'The Matrix'\t2005\n"
     ]
    }
   ],
   "source": [
    "print(\"The Matrix before updte: \")\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "WHERE n.title = \"The Matrix\"\n",
    "RETURN n.title, n.year\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(d,\"\\n\")\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "WHERE n.title = \"The Matrix\"\n",
    "SET n.year = 2005\n",
    "RETURN n.title, n.year\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "print(\"The matrix Updated: \")\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### DELTE From Graph elements (Nodes or Relationships), and Removing Properities with Cypher\n",
    "\n",
    "* The <b>REMOVE</b> clause is used to remove properties from nodes and relationships, and to remove labels from nodes.\n",
    "\n",
    "* While the <b> DELETE </b> clause is used to delete nodes, relationships or paths."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Remove the ```tagLine``` from the ```Movie``` Node\n",
    "\n",
    "- Notice Movie \"The Matrix\" before and after!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "BEFORE:\n",
      "Node('Movie', id=4, tagline='Welcome to the Real World', title='The Matrix', year=2005)\n",
      "AFTER:\n",
      "Node('Movie', id=4, title='The Matrix', year=2005)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "WHERE n.title = \"The Matrix\"\n",
    "RETURN n\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(\"BEFORE:\")\n",
    "    print(d)\n",
    "    \n",
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "WHERE n.title = \"The Matrix\"\n",
    "REMOVE n.tagline\n",
    "RETURN n\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(\"AFTER:\")\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Remove the ```Director``` label from Person nodes with that label\n",
    "\n",
    "* Note that, only some of these people have the \"Director\" Label\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### First, show all the Person nodes in your DB "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "WHERE n.title = \"The Matrix\"\n",
    "RETURN n\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(\"BEFORE:\")\n",
    "    print(d)\n",
    "    \n",
    "query = \"\"\"\n",
    "MATCH (n:Movie)\n",
    "WHERE n.title = \"The Matrix\"\n",
    "REMOVE n.tagline\n",
    "RETURN n\n",
    "\"\"\"\n",
    "data = graph.run(query)\n",
    "for d in data:\n",
    "    print(\"AFTER:\")\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\n",
      "Node('Person', born=1967, id=5, name='Lilly Wachowski', role='Director')\n",
      "Node('Person', born=1965, id=6, name='Lana Wachowski', role='Director')\n",
      "Node('Person', born=1952, id=7, name='Joel Silver', role='Director')\n",
      "Node('Person')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n:Person)\n",
    "RETURN n\n",
    "\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Second: Remove the Director Label, and Return the result to make sure that labels are already removed"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1960, id=8, name='Hugo Weaving')\n",
      "Node('Person', born=1967, id=5, name='Lilly Wachowski')\n",
      "Node('Person', born=1965, id=6, name='Lana Wachowski')\n",
      "Node('Person', born=1952, id=7, name='Joel Silver')\n",
      "Node('Person')\n"
     ]
    }
   ],
   "source": [
    "query= \"\"\"\n",
    "MATCH (n:Person)\n",
    "REMOVE n.role\n",
    "RETURN n\n",
    "\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Delete \"Agent Smith\", the Actor with the name <b>\"Hugo Weaving\"</b>  as he is the bad guy here :) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [],
   "source": [
    "# REFENCE: https://neo4j.com/docs/cypher-manual/current/clauses/delete/#delete-delete-single-node\n",
    "query= \"\"\"\n",
    "MATCH (n:Person { name: 'Hugo Weaving' })\n",
    "DETACH DELETE n\n",
    "\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1967, id=5, name='Lilly Wachowski')\n",
      "Node('Person', born=1965, id=6, name='Lana Wachowski')\n",
      "Node('Person', born=1952, id=7, name='Joel Silver')\n",
      "Node('Person')\n"
     ]
    }
   ],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Try to get/find this actor again "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node('Person', id=1, name='Charlie Sheen')\n",
      "Node('Person', id=3, name='Martin Sheen')\n",
      "Node('Person', id=4, name='Morgan Freeman')\n",
      "Node('Person', id=2, name='Micheal Douglas')\n",
      "Node('Person', born=1964, id=5, name='Keanu Reeves')\n",
      "Node('Person', born=1967, id=6, name='Carrie-Anne Moss')\n",
      "Node('Person', born=1960, id=7, name='Laurence Fishburne')\n",
      "Node('Person', born=1967, id=5, name='Lilly Wachowski')\n",
      "Node('Person', born=1965, id=6, name='Lana Wachowski')\n",
      "Node('Person', born=1952, id=7, name='Joel Silver')\n",
      "Node('Person')\n"
     ]
    }
   ],
   "source": [
    "query= \"\"\"\n",
    "MATCH (n:Person)\n",
    "REMOVE n.role\n",
    "RETURN n\n",
    "\"\"\"\n",
    "personNodes = graph.run(query)\n",
    "for person in personNodes:\n",
    "    print(person)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "`Hugo Weaving` already deleted"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Task 2 (OPTIONAL TASK) : Perform some queries on the Graph database using Cypher Query Language.\n",
    "In this task, you are going to:\n",
    "- Import movielens graph database into neo4j\n",
    "- Perform Several Cypher quereis on this database"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### The movielens Dataset\n",
    "\n",
    "- The dataset that we are using consists of data obtained from MovieLens 1, a recommender system whose users give movies a rate between 1 and 5 based on whether they dislike or love them. \n",
    "- MovieLens uses the rates to recommend movies that its users might like. \n",
    "- The dataset is modeled as a directed graph and consists of 100,004 rates on 9,125 movies across 671 users between January 9th, 1995 and October 16, 2016. - The dataset also contains the names of the directors and the actors of each movie. A directed graph G = (V , E ) consists of:\n",
    "\n",
    "   - A set V of nodes corresponding to the entities, such as movies, users, actors and directors.\n",
    "   - A set E of links, each connecting two nodes and representing a relationship between two entities. For instance, a link between a director and a movie represents the relationship “directed by”.\n",
    "\n",
    "\n",
    "##### Import mvielens.db into Neo4j\n",
    "- 1- Please, copy the attached 'mvielens.db' graph DB file to your neo4jhome/data/databases/\n",
    "-  2- change the active DB from the neo4j configuration to the mvielens.db, by default it is graph.db by edititng the file neo4jhome/conf/neo4j.conf and change graph.db to mvielens.db in the line dbms.active_database=graph.db (after removing the '#' from the begininnig of that line)\n",
    "-  3- Don't forget to restart neo4j server (neo4jhome/bin/neo4j restart).\n",
    "\n",
    "-  4- In the following subtasks, Write the Cypher Query which will perform each of the following tasks"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Simplified Schema with labels of DB:\n",
    "- If your run this command (\"call db.schema()\") into your DB you should see such graph DB schema"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<img src=\"movielensschema.JPG\" alt=\"3\" border=\"0\">"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the distinct genres of the movies in the database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "cqlEdgeQuery = 'YOUR CYPHER QUERY HERE'\n",
    "\n",
    "with graphDB_Driver.session() as graphDB_Session:\n",
    "    nodes = graphDB_Session.run(cqlEdgeQuery)\n",
    "    for node in nodes:\n",
    "        print(node)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### ipython-cypher\n",
    "[ipython-cypher](https://github.com/versae/ipython-cypher) is another way to connect to a graph database in python. it uses <b> neo4jrestclient_ driver </b>, then issue Cypher commands within IPython or IPython Notebook.\n",
    "#### ipython-cypher install"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# ! pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Inside IPython, load the extension:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### And then you are reay to go by using the <b>%cypher</b> or <b>%%cypher</b> line magic:\n",
    "\n",
    "you have to write down the connection url http://username:password@127.0.0.1:7474/db/data after the %%cypher to access your active DB using the neo4j http port (7474)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "- '''%cypher''' is intended for one-line Cypher queries and '''%%cypher''' is intended for multi-line Cypher queries. \n",
    "- Placing \"%%cypher\" above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Format: (http|https)://username:password@hostname:port/db/name\n"
     ]
    },
    {
     "ename": "StatusException",
     "evalue": "Code [401]: Unauthorized. No permission -- see authorization schemes.\nAuthorization Required",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mStatusException\u001b[0m                           Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-4-3960788d2308>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mget_ipython\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun_line_magic\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'cypher'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m' http://neo4j:engmohamed@127.0.0.1:7474/db/data   MATCH (g:Genre) RETURN Distinct g.name AS genre'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/IPython/core/interactiveshell.py\u001b[0m in \u001b[0;36mrun_line_magic\u001b[0;34m(self, magic_name, line, _stack_depth)\u001b[0m\n\u001b[1;32m   2315\u001b[0m                 \u001b[0mkwargs\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'local_ns'\u001b[0m\u001b[0;34m]\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msys\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_getframe\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mstack_depth\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mf_locals\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   2316\u001b[0m             \u001b[0;32mwith\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbuiltin_trap\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 2317\u001b[0;31m                 \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfn\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   2318\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   2319\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m<decorator-gen-841>\u001b[0m in \u001b[0;36mexecute\u001b[0;34m(self, line, cell, local_ns)\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/IPython/core/magic.py\u001b[0m in \u001b[0;36m<lambda>\u001b[0;34m(f, *a, **k)\u001b[0m\n\u001b[1;32m    185\u001b[0m     \u001b[0;31m# but it's overkill for just that one bit of state.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    186\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mmagic_deco\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 187\u001b[0;31m         \u001b[0mcall\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mlambda\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    188\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    189\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m<decorator-gen-840>\u001b[0m in \u001b[0;36mexecute\u001b[0;34m(self, line, cell, local_ns)\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/IPython/core/magic.py\u001b[0m in \u001b[0;36m<lambda>\u001b[0;34m(f, *a, **k)\u001b[0m\n\u001b[1;32m    185\u001b[0m     \u001b[0;31m# but it's overkill for just that one bit of state.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    186\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mmagic_deco\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 187\u001b[0;31m         \u001b[0mcall\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;32mlambda\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mf\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0ma\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mk\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    188\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    189\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcallable\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0marg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/cypher/magic.py\u001b[0m in \u001b[0;36mexecute\u001b[0;34m(self, line, cell, local_ns)\u001b[0m\n\u001b[1;32m    106\u001b[0m         \u001b[0muser_ns\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mupdate\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mlocal_ns\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    107\u001b[0m         \u001b[0mparsed\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mparse\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"\"\"{0}\\n{1}\"\"\"\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mformat\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mline\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcell\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 108\u001b[0;31m         \u001b[0mconn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mConnection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'as'\u001b[0m\u001b[0;34m]\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'uri'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'as'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    109\u001b[0m         \u001b[0mfirst_word\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mparsed\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m'cypher'\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msplit\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;36m1\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    110\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mfirst_word\u001b[0m \u001b[0;32mand\u001b[0m \u001b[0mfirst_word\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;36m0\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mlower\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34m'persist'\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/cypher/connection.py\u001b[0m in \u001b[0;36mget\u001b[0;34m(cls, descriptor, alias)\u001b[0m\n\u001b[1;32m     45\u001b[0m                 \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mconn\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     46\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 47\u001b[0;31m                 \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mConnection\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdescriptor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0malias\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     48\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     49\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mcls\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcurrent\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/cypher/connection.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, connect_str, alias)\u001b[0m\n\u001b[1;32m     24\u001b[0m                 \u001b[0mgdb\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mGraphDatabase\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnections\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mconnect_str\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     25\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 26\u001b[0;31m                 \u001b[0mgdb\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mGraphDatabase\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mconnect_str\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     27\u001b[0m                 \u001b[0malias\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0malias\u001b[0m \u001b[0;32mor\u001b[0m \u001b[0mconnect_str\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     28\u001b[0m         \u001b[0;32mexcept\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/neo4jrestclient/client.py\u001b[0m in \u001b[0;36m__init__\u001b[0;34m(self, url, username, password, cert_file, key_file)\u001b[0m\n\u001b[1;32m     77\u001b[0m         \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     78\u001b[0m             \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0murl\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m\"%s/\"\u001b[0m \u001b[0;34m%\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 79\u001b[0;31m         \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mRequest\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m**\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_auth\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mget\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     80\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstatus_code\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m200\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     81\u001b[0m             \u001b[0mresponse_json\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mjson\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/neo4jrestclient/request.py\u001b[0m in \u001b[0;36mget\u001b[0;34m(self, url, headers)\u001b[0m\n\u001b[1;32m     61\u001b[0m         \u001b[0mReturns\u001b[0m \u001b[0mthe\u001b[0m \u001b[0mresponse\u001b[0m \u001b[0mobject\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     62\u001b[0m         \"\"\"\n\u001b[0;32m---> 63\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_request\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'GET'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mheaders\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     64\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     65\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mpost\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0;32mNone\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/neo4jrestclient/request.py\u001b[0m in \u001b[0;36m_request\u001b[0;34m(self, method, url, data, headers)\u001b[0m\n\u001b[1;32m    198\u001b[0m                                                 auth=auth, verify=verify)\n\u001b[1;32m    199\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mstatus_code\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m401\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 200\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mStatusException\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m401\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m\"Authorization Required\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    201\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    202\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0mAttributeError\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mStatusException\u001b[0m: Code [401]: Unauthorized. No permission -- see authorization schemes.\nAuthorization Required"
     ]
    }
   ],
   "source": [
    "%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   MATCH (g:Genre) RETURN Distinct g.name AS genre"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2. Get the number of movies in the database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   MATCH (m:Movie) RETURN m"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the title of the movies released in 2005"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "###YOUR QUERY HERE \n",
    "##(make it as multiline if you want)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the number of directors by movie. Sort in decreasing order."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data\n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the names of the directors and the title of the movies that they directed and in which they also played."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the genres of the movies in which Tom Hanks played."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the title and the rate of all the movies that the user number 3 rated. Sort by rate in decreasing order."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Get the five movies that obtained the best average rate among the movies that have been rated by at least 100 users."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "%%cypher  http://neo4j:engmohamed@127.0.0.1:7474/db/data   \n",
    "###YOUR QUERY HERE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " ## How long did it take you to solve the homework?\n",
    " \n",
    "Please answer as precisely as you can. It does not affect your points or grade in any way. It is okey, if it took 0.5 hours or 24 hours. The collected information will be used to improve future homeworks."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<font color=\"red\"><b>Answer:</b></font> 8 hours"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**<center> <font color='red'>THANK YOU FOR YOUR EFFORT!</font></center>**"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
